#+TITLE: Xd75
#+PROPERTY: header-args :tangle ~/qmk_firmware/keyboards/xiudi/xd75/keymaps/foe/test_keymap.c :comments no :main no

This is my qmk firmware for my keyboard. I grew tired of organizing the keycode
array in plain text so I made it a literate .org file. I've never done this
before, so bear with me.

* Keymap Conversion in Python

  This python can convert that table into the array needed for the keymap file. It
  simply prepends every key with "KC_". I used to use a dictionary to convert some
  keys from the table into qmk keycodes, but the double convertion was
  unneccessary so I just prepended all my macros with KC and moved all the
  implementation to the `process-user-input` function.

#+NAME:layer-to-array
#+BEGIN_SRC python :var keys=fn-layer :tangle no
row = 0
results = ''
while row < len(keys):
    key = 0
    while key < len(keys[row]):
        keyName = str(keys[row][key])
        if keyName == '--':
            keyName = 'TRANSPARENT'
        if keyName.startswith('RESET') or keyName.startswith('RGB'):
            results += keyName
        else:
            results += 'KC_' + keyName
        if key != 14:
            results += ', '
        key+=1
    if row != 5:
        results += ','
    results += '\n'
    row+=1
return results
#+END_SRC

  #+RESULTS: layer-to-array
  : KC_F1, KC_F2, KC_F3, KC_F4, KC_F5, KC_F6, KC_NLCK, KC_SLSH, KC_ASTR, KC_F7, KC_F8, KC_F9, KC_F10, KC_F11, KC_F12,
  : KC_MSEL, KC_CALC, KC_MYCM, KC_MAIL, RGB_HUD, RGB_HUI, KC_P7, KC_P8, KC_P9, KC_MINS, KC_TRANSPARENT, KC_TRANSPARENT, KC_PSCR, KC_SLCK, KC_PAUS,
  : KC_MPRV, KC_MPLY, KC_MNXT, KC_E, RGB_SAD, RGB_SAI, KC_P4, KC_P5, KC_P6, KC_PLUS, KC_TRANSPARENT, RESET, KC_TRANSPARENT, KC_TRANSPARENT, KC_TRANSPARENT,
  : KC_VOLD, KC_MUTE, KC_VOLU, KC_APP, RGB_VAD, RGB_VAI, KC_P1, KC_P2, KC_P3, KC_PENT, KC_TRANSPARENT, KC_TRANSPARENT, KC_TRANSPARENT, KC_TRANSPARENT, KC_TRANSPARENT,
  : KC_TRANSPARENT, KC_TRANSPARENT, RGB_TOG, KC_FN, RGB_RMOD, RGB_MOD, KC_P0, KC_TRANSPARENT, KC_PDOT, KC_PENT, KC_PENT, KC_FN, KC_TRANSPARENT, KC_TRANSPARENT, KC_TRANSPARENT,


